       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGI0002.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT VSAM-FILE ASSIGN TO 'STUDENT.VSAM'
               ORGANIZATION IS INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS STUDENT-ID.

       DATA DIVISION.
       FILE SECTION.
       FD VSAM-FILE.
       COPY 'STUDENT.CPY'.

       WORKING-STORAGE SECTION.
       01 NEW-ID              PIC 9(4).
       01 CURRENT-DATE        PIC 9(8) VALUE 20230729.

       PROCEDURE DIVISION.
           DISPLAY "ENTER STUDENT ID (4 digits): "
           ACCEPT STUDENT-ID

           DISPLAY "ENTER FULL NAME (max 25): "
           ACCEPT STUDENT-NAME

           DISPLAY "ENTER BIRTHDAY (YYYYMMDD): "
           ACCEPT STUDENT-BIRTHDAY

           DISPLAY "ENTER COURSE (max 15): "
           ACCEPT STUDENT-COURSE

           MOVE CURRENT-DATE TO STUDENT-INS-DATE
           MOVE ZEROES TO STUDENT-UPD-DATE

           OPEN I-O VSAM-FILE

           WRITE STUDENT-REC
               INVALID KEY DISPLAY "STUDENT ALREADY EXISTS."

           CLOSE VSAM-FILE

           DISPLAY "STUDENT INSERTED SUCCESSFULLY."
           GOBACK.
