       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGU0003.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT VSAM-FILE ASSIGN TO 'STUDENT.VSAM'
       ORGANIZATION IS INDEXED
       ACCESS MODE IS DYNAMIC
       RECORD KEY IS STUDENT-ID.

       DATA DIVISION.
       FILE SECTION.
       FD VSAM-FILE.
       COPY 'STUDENT.CPY'.

       WORKING-STORAGE SECTION.
       01 CURRENT-DATE PIC 9(8) VALUE 20230729.

       PROCEDURE DIVISION.
       MAIN-PROCESS.
           DISPLAY "ENTER STUDENT ID TO UPDATE:"
           ACCEPT STUDENT-ID

           OPEN I-O VSAM-FILE

           READ VSAM-FILE
               INVALID KEY
                   DISPLAY "STUDENT NOT FOUND."
               NOT INVALID KEY
                   DISPLAY "ENTER NEW NAME:"
                   ACCEPT STUDENT-NAME
                   DISPLAY "ENTER NEW BIRTHDAY:"
                   ACCEPT STUDENT-BIRTHDAY
                   DISPLAY "ENTER NEW COURSE:"
                   ACCEPT STUDENT-COURSE
                   MOVE CURRENT-DATE TO STUDENT-UPD-DATE
                   REWRITE STUDENT-REC
                   DISPLAY "STUDENT UPDATED."
           END-READ

           CLOSE VSAM-FILE
           GOBACK.
