       01  STUDENT-REC.
           05 STUDENT-ID        PIC 9(4).
           05 STUDENT-NAME      PIC X(25).
           05 STUDENT-BIRTHDAY  PIC 9(8).
           05 STUDENT-COURSE    PIC X(15).
           05 STUDENT-INS-DATE  PIC 9(8).
           05 STUDENT-UPD-DATE  PIC 9(8).
